import ExperienceItem from "../experience-item/experience-item";

import "../experience/experience.css";

const experienceData = [
  {
    position: "Главный разработчик(Team Lead js content)",
    company: "ООО ТЕХНОЛОГИИ ОБРАЗОВАНИЯ",
    period: "Май 2023 - по текущее время",
    responsibilities: [
      "Созвоны с командой для планирования дальнейшей работы и оценки эмоционального состояния каждого сотрудника.",
      "Наставничество и обучение новых сотрудников.",
      "Ведение компонентов и документации.",
      "Помощь разработчикам с кодом.",
      "Периодическая оценка сотрудников и построение планов на развитие.",
      "Разрешение конфликтных ситуаций на сторонах с другими отделами.",
      "Написание карт/правки.",
    ],
  },
  {
    position: "Разработчик(Frontend developer)",
    company: `ООО "УЧИ.РУ" Группа разработки основного подразделения.`,
    period: "Февраль 2018 - Май 2023",
    responsibilities: ["Написание карт/правки.", "Наставничество и обучение новых сотрудников.", "Помощь разработчикам с кодом."],
  },
  {
    position: "Web-разработчик",
    company: `LineRF`,
    period: "Июнь 2016 - Сентябрь 2017",
    responsibilities: [
      "Размещение проектов на хостинг дальнейшее их управление и обслуживание.",
      "Настройка метрики и целей, подключение внешних систем аналитики.",
      "Выполнение работ контент менеджера в интернет магазине, а так же администрирование и управление на движке 1С-Битрикс.",
      "Администрирование сетями и рабочими станциями, обслуживание орг.техники, подключение и настройка CRM системы.",
    ],
  },
  {
    position: "Администратор БД",
    company: `ИСА Дельф-Инфо`,
    period: "Сентябрь 2015 - Январь 2016",
    responsibilities: [
      "Поддержание в актуальном рабочем состоянии полного объема информации.",
      "Обучение работников организации приемам и навыкам работы на компьютерах, а также работе с внедряемыми программными средствами.",
    ],
  },
];

export default function Experience() {
  return (
    <section className="experience">
      <h2 className="experience-header">Опыт работы </h2>
      <div className="experience-group">
        {experienceData.map((port) => {
          return (
            <ExperienceItem
              position={port.position}
              company={port.company}
              period={port.period}
              responsibilities={port.responsibilities}
            />
          );
        })}
      </div>
    </section>
  );
}
